export const EMOTION_CATEGORIES = {
  'ГНЕВ': ['бешенство', 'ярость', 'ненависть', 'истерия', 'злость', 'раздражение', 'презрение', 'негодование', 'обида', 'ревность', 'досада', 'зависть', 'неприязнь', 'возмущение', 'отвращение'],
  'СТРАХ': ['ужас', 'отчаяние', 'испуг', 'оцепенение', 'подозрение', 'тревога', 'ошарашенность', 'беспокойство', 'боязнь', 'унижение', 'замешательство', 'растерянность', 'вина, стыд', 'сомнение', 'застенчивость', 'опасение', 'смущение', 'сломленность', 'подвох', 'надменность', 'ошеломлённость', 'уязвимость'],
  'ГРУСТЬ': ['горечь', 'тоска', 'скорбь', 'лень', 'жалость', 'отрешённость', 'отчаяние', 'беспомощность', 'душевная боль', 'безнадёжность', 'отчуждённость', 'разочарование', 'потрясение', 'сожаление', 'скука', 'безысходность', 'печаль', 'загнанность', 'одиночество', 'апатия', 'уныние', 'ностальгия', 'истощение'],
  'РАДОСТЬ': ['счастье', 'восторг', 'ликование', 'приподнятость', 'оживление', 'умиротворение', 'увлечение', 'интерес', 'забота', 'ожидание', 'возбуждение', 'предвкушение', 'надежда', 'любопытство', 'освобождение', 'принятие', 'нетерпение', 'вера', 'изумление', 'вдохновение', 'удовлетворение', 'облегчение'],
  'ЛЮБОВЬ': ['нежность', 'теплота', 'сочувствие', 'блаженство', 'доверие', 'безопасность', 'благодарность', 'спокойствие', 'симпатия', 'идентичность', 'гордость', 'восхищение', 'уважение', 'самоценность', 'влюблённость', 'любовь к себе', 'очарованность', 'смирение', 'искренность', 'дружелюбие', 'доброта', 'взаимовыручка']
};

export type CategoryName = keyof typeof EMOTION_CATEGORIES;

export const CYCLE_PHASES = [
  'менструация',
  'фолликулярная фаза',
  'овуляция',
  'лютеиновая фаза',
  'пмс'
];

export interface DailyLog {
  id: string; // We'll just use the date string YYYY-MM-DD as ID to easily overwrite if submitted again
  date: string; // YYYY-MM-DD
  emotions: string[]; 
  cyclePhase?: string;
  note?: string;
  timestamp: number;
}
